{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "BAR_END": 5,
      "BAR_START": 6,
      "TIME_DELTA=1.0": 7,
      "TIME_DELTA=2.0": 8,
      "TIME_DELTA=0.04166666666666696": 9,
      "TIME_DELTA=0.041666666666666075": 10,
      "TIME_DELTA=4.0": 11,
      "NOTE_OFF=67": 12,
      "NOTE_ON=67": 13,
      "NOTE_OFF=62": 14,
      "NOTE_ON=62": 15,
      "NOTE_OFF=69": 16,
      "NOTE_ON=69": 17,
      "NOTE_OFF=74": 18,
      "NOTE_ON=74": 19,
      "NOTE_OFF=65": 20,
      "NOTE_ON=65": 21,
      "TIME_DELTA=0.04166666666666652": 22,
      "NOTE_OFF=60": 23,
      "NOTE_ON=60": 24,
      "NOTE_OFF=64": 25,
      "NOTE_ON=64": 26,
      "NOTE_OFF=72": 27,
      "NOTE_ON=72": 28,
      "NOTE_OFF=55": 29,
      "NOTE_ON=55": 30,
      "TIME_DELTA=0.5": 31,
      "TIME_DELTA=1.958333333333333": 32,
      "NOTE_OFF=57": 33,
      "NOTE_ON=57": 34,
      "TIME_DELTA=0.958333333333333": 35,
      "NOTE_OFF=76": 36,
      "NOTE_ON=76": 37,
      "NOTE_OFF=58": 38,
      "NOTE_ON=58": 39,
      "TIME_DELTA=0.9583333333333339": 40,
      "NOTE_OFF=63": 41,
      "NOTE_ON=63": 42,
      "NOTE_OFF=71": 43,
      "NOTE_ON=71": 44,
      "NOTE_OFF=79": 45,
      "NOTE_ON=79": 46,
      "TRACK_END": 47,
      "TRACK_START": 48,
      "TIME_DELTA=1.958333333333334": 49,
      "NOTE_OFF=70": 50,
      "NOTE_ON=70": 51,
      "NOTE_OFF=59": 52,
      "NOTE_ON=59": 53,
      "NOTE_OFF=77": 54,
      "NOTE_ON=77": 55,
      "NOTE_OFF=68": 56,
      "NOTE_ON=68": 57,
      "NOTE_OFF=75": 58,
      "NOTE_ON=75": 59,
      "NOTE_OFF=53": 60,
      "NOTE_ON=53": 61,
      "NOTE_OFF=50": 62,
      "NOTE_ON=50": 63,
      "NOTE_OFF=66": 64,
      "NOTE_ON=66": 65,
      "NOTE_OFF=81": 66,
      "NOTE_ON=81": 67,
      "NOTE_OFF=52": 68,
      "NOTE_ON=52": 69,
      "NOTE_OFF=48": 70,
      "NOTE_ON=48": 71,
      "NOTE_OFF=56": 72,
      "NOTE_ON=56": 73,
      "NOTE_OFF=61": 74,
      "NOTE_ON=61": 75,
      "NOTE_OFF=73": 76,
      "NOTE_ON=73": 77,
      "NOTE_OFF=51": 78,
      "NOTE_ON=51": 79,
      "NOTE_OFF=78": 80,
      "NOTE_ON=78": 81,
      "TIME_DELTA=0.9583333333333335": 82,
      "TIME_DELTA=0.04166666666666674": 83,
      "NOTE_OFF=54": 84,
      "NOTE_ON=54": 85,
      "TIME_DELTA=0.25": 86,
      "NOTE_OFF=80": 87,
      "NOTE_ON=80": 88,
      "NOTE_OFF=43": 89,
      "NOTE_ON=43": 90,
      "NOTE_OFF=46": 91,
      "NOTE_ON=46": 92,
      "TIME_DELTA=1.9583333333333333": 93,
      "TIME_DELTA=1.2916666666666667": 94,
      "NOTE_OFF=83": 95,
      "NOTE_ON=83": 96,
      "NOTE_OFF=45": 97,
      "NOTE_ON=45": 98,
      "NOTE_OFF=84": 99,
      "NOTE_ON=84": 100,
      "NOTE_OFF=47": 101,
      "NOTE_ON=47": 102,
      "TIME_DELTA=0.125": 103,
      "NOTE_OFF=82": 104,
      "NOTE_ON=82": 105,
      "DENSITY=0": 106,
      "TIME_DELTA=3.958333333333334": 107,
      "NOTE_OFF=49": 108,
      "NOTE_ON=49": 109,
      "TIME_DELTA=0.625": 110,
      "TIME_DELTA=8.0": 111,
      "NOTE_OFF=41": 112,
      "NOTE_ON=41": 113,
      "TIME_DELTA=0.08333333333333393": 114,
      "NOTE_OFF=86": 115,
      "NOTE_ON=86": 116,
      "TIME_DELTA=0.6666666666666661": 117,
      "TIME_DELTA=0.08333333333333304": 118,
      "NOTE_OFF=44": 119,
      "NOTE_ON=44": 120,
      "TIME_DELTA=0.6666666666666666": 121,
      "TIME_DELTA=1.3333333333333333": 122,
      "TIME_DELTA=1.333333333333334": 123,
      "TIME_DELTA=0.04166666666666663": 124,
      "TIME_DELTA=0.875": 125,
      "PIECE_START": 126,
      "TIME_DELTA=0.041666666666666664": 127,
      "TIME_DELTA=0.04166666666666785": 128,
      "GENRE=OTHER": 129,
      "NOTE_OFF=36": 130,
      "NOTE_ON=36": 131,
      "NOTE_OFF=40": 132,
      "NOTE_ON=40": 133,
      "TIME_DELTA=0.75": 134,
      "TIME_DELTA=3.333333333333334": 135,
      "TIME_DELTA=0.9583333333333334": 136,
      "TIME_DELTA=1.458333333333333": 137,
      "NOTE_OFF=85": 138,
      "NOTE_ON=85": 139,
      "NOTE_OFF=39": 140,
      "NOTE_ON=39": 141,
      "INST=42": 142,
      "TIME_DELTA=3.0": 143,
      "INST=40": 144,
      "TIME_DELTA=3.9583333333333335": 145,
      "NOTE_OFF=38": 146,
      "NOTE_ON=38": 147,
      "TIME_DELTA=1.916666666666666": 148,
      "TIME_DELTA=0.45833333333333304": 149,
      "TIME_DELTA=0.8833333333333329": 150,
      "NOTE_OFF=42": 151,
      "NOTE_ON=42": 152,
      "NOTE_OFF=88": 153,
      "NOTE_ON=88": 154,
      "TIME_DELTA=0.666666666666667": 155,
      "INST=0": 156,
      "TIME_DELTA=0.6666666666666665": 157,
      "TIME_DELTA=0.40000000000000036": 158,
      "TIME_DELTA=6.0": 159,
      "TIME_DELTA=1.5999999999999996": 160,
      "TIME_DELTA=1.7763568394002505e-15": 161,
      "TIME_DELTA=1.5": 162,
      "TIME_DELTA=0.541666666666667": 163,
      "TIME_DELTA=1.291666666666666": 164,
      "TIME_DELTA=1.916666666666667": 165,
      "TIME_DELTA=0.2666666666666666": 166,
      "TIME_DELTA=1.75": 167,
      "TIME_DELTA=0.3333333333333339": 168,
      "TIME_DELTA=0.4583333333333339": 169,
      "DENSITY=4": 170,
      "NOTE_OFF=87": 171,
      "NOTE_ON=87": 172,
      "TIME_DELTA=1.1166666666666671": 173,
      "TIME_DELTA=1.333333333333333": 174,
      "TIME_DELTA=0.3333333333333333": 175,
      "TIME_DELTA=3.916666666666666": 176,
      "TIME_DELTA=1.3333333333333335": 177,
      "TIME_DELTA=1.458333333333334": 178,
      "TIME_DELTA=4.440892098500626e-16": 179,
      "TIME_DELTA=0.7999999999999998": 180,
      "DENSITY=3": 181,
      "TIME_DELTA=2.666666666666666": 182,
      "INST=41": 183,
      "DENSITY=1": 184,
      "TIME_DELTA=1.25": 185,
      "TIME_DELTA=0.23333333333333334": 186,
      "DENSITY=2": 187,
      "TIME_DELTA=8.881784197001252e-16": 188,
      "TIME_DELTA=3.3333333333333335": 189,
      "TIME_DELTA=3.5": 190,
      "TIME_DELTA=0.06666666666666643": 191,
      "TIME_DELTA=0.29166666666666696": 192,
      "TIME_DELTA=0.2916666666666665": 193,
      "NOTE_OFF=37": 194,
      "NOTE_ON=37": 195,
      "NOTE_OFF=89": 196,
      "NOTE_ON=89": 197,
      "TIME_DELTA=0.04999999999999982": 198,
      "TIME_DELTA=0.5999999999999996": 199,
      "TIME_DELTA=12.0": 200,
      "TIME_DELTA=2.958333333333334": 201,
      "TIME_DELTA=0.2916666666666661": 202,
      "TIME_DELTA=0.4583333333333335": 203,
      "TIME_DELTA=0.08333333333333348": 204,
      "TIME_DELTA=1.7333333333333334": 205,
      "TIME_DELTA=0.5416666666666661": 206,
      "TIME_DELTA=0.9583333333333333": 207,
      "TIME_DELTA=0.05000000000000071": 208,
      "TIME_DELTA=0.708333333333333": 209,
      "TIME_DELTA=1.9333333333333336": 210,
      "TIME_DELTA=0.33333333333333304": 211,
      "TIME_DELTA=0.09999999999999964": 212,
      "TIME_DELTA=0.7083333333333335": 213,
      "TIME_DELTA=1.875": 214,
      "TIME_DELTA=1.291666666666667": 215,
      "NOTE_OFF=35": 216,
      "NOTE_ON=35": 217,
      "TIME_DELTA=2.041666666666667": 218,
      "NOTE_OFF=34": 219,
      "NOTE_ON=34": 220,
      "TIME_DELTA=0.13333333333333286": 221,
      "TIME_DELTA=1.6": 222,
      "TIME_DELTA=0.3999999999999999": 223,
      "TIME_DELTA=0.375": 224,
      "TIME_DELTA=1.0666666666666667": 225,
      "TIME_SIGNATURE": 226,
      "TIME_DELTA=3.9166666666666665": 227,
      "TIME_DELTA=1.7333333333333343": 228,
      "TIME_DELTA=1.9583333333333321": 229,
      "TIME_DELTA=0.20000000000000018": 230,
      "TIME_DELTA=2.916666666666666": 231,
      "NOTE_OFF=91": 232,
      "NOTE_ON=91": 233,
      "TIME_DELTA=7.0": 234,
      "TIME_DELTA=0.3333333333333335": 235,
      "TIME_DELTA=1.9166666666666667": 236,
      "TIME_SIGNATURE=3_4": 237,
      "TIME_DELTA=0.8833333333333333": 238,
      "TIME_DELTA=0.2666666666666657": 239,
      "TIME_DELTA=0.7083333333333339": 240,
      "TIME_DELTA=0.8666666666666671": 241,
      "TIME_DELTA=1.041666666666666": 242,
      "NOTE_OFF=31": 243,
      "NOTE_ON=31": 244,
      "TIME_DELTA=0.916666666666667": 245,
      "TIME_DELTA=0.08333333333333326": 246,
      "NOTE_OFF=33": 247,
      "NOTE_ON=33": 248,
      "TIME_DELTA=1.2916666666666679": 249,
      "TIME_DELTA=0.43333333333333357": 250,
      "TIME_DELTA=0.8854166666666661": 251,
      "TIME_DELTA=0.26666666666666666": 252,
      "TIME_DELTA=1.1166666666666667": 253,
      "NOTE_OFF=90": 254,
      "NOTE_ON=90": 255,
      "TIME_DELTA=0.984375": 256,
      "TIME_DELTA=1.2000000000000002": 257,
      "TIME_DELTA=0.9583333333333321": 258,
      "TIME_DELTA=1.4583333333333333": 259,
      "TIME_DELTA=2.220446049250313e-16": 260,
      "TIME_DELTA=1.4000000000000004": 261,
      "TIME_DELTA=0.5833333333333339": 262,
      "TIME_DELTA=1.416666666666666": 263,
      "TIME_DELTA=0.16666666666666607": 264,
      "TIME_DELTA=3.2": 265,
      "TIME_DELTA=0.20833333333333304": 266,
      "TIME_DELTA=3.9000000000000004": 267,
      "INST=71": 268,
      "TIME_DELTA=1.416666666666667": 269,
      "TIME_DELTA=1.7666666666666666": 270,
      "TIME_DELTA=0.6666666666666679": 271,
      "TIME_DELTA=0.5416666666666667": 272,
      "TIME_DELTA=2.6666666666666665": 273,
      "TIME_DELTA=0.583333333333333": 274,
      "TIME_DELTA=0.16666666666666696": 275,
      "TIME_DELTA=0.9166666666666661": 276,
      "TIME_DELTA=1.0416666666666665": 277,
      "TIME_DELTA=7.958333333333333": 278,
      "TIME_DELTA=1.33203125": 279,
      "NOTE_OFF=32": 280,
      "NOTE_ON=32": 281,
      "TIME_DELTA=0.033333333333333215": 282,
      "TIME_DELTA=1.015625": 283,
      "TIME_DELTA=1.1999999999999993": 284,
      "TIME_DELTA=0.3000000000000007": 285,
      "TIME_DELTA=7.958333333333332": 286,
      "TIME_DELTA=2.9583333333333335": 287,
      "TIME_DELTA=0.037499999999999645": 288,
      "INST=60": 289,
      "TIME_DELTA=0.520833333333333": 290,
      "TIME_DELTA=0.2666666666666675": 291,
      "TIME_DELTA=1.479166666666667": 292,
      "TIME_DELTA=16.0": 293,
      "TIME_DELTA=0.2999999999999998": 294,
      "TIME_DELTA=0.8000000000000007": 295,
      "TIME_DELTA=0.03333333333333333": 296,
      "TIME_DELTA=0.7000000000000002": 297,
      "TIME_DELTA=1.114583333333334": 298,
      "TIME_DELTA=1.083333333333334": 299,
      "TIME_DELTA=0.020833333333333925": 300,
      "TIME_DELTA=1.4": 301,
      "TIME_DELTA=2.25": 302,
      "TIME_DELTA=0.4166666666666661": 303,
      "TIME_DELTA=0.9500000000000002": 304,
      "TIME_DELTA=0.5666666666666664": 305,
      "TIME_DELTA=0.8": 306,
      "TIME_DELTA=0.020833333333333037": 307,
      "TIME_DELTA=1.9999999999999982": 308,
      "TIME_DELTA=0.05": 309,
      "TIME_DELTA=1.0666666666666664": 310,
      "TIME_DELTA=0.1333333333333333": 311,
      "TIME_DELTA=0.45833333333333326": 312,
      "TIME_DELTA=0.16666666666666652": 313,
      "TIME_DELTA=0.08333333333333215": 314,
      "TIME_DELTA=0.2916666666666667": 315,
      "TIME_DELTA=3.9": 316,
      "INST=70": 317,
      "TIME_DELTA=0.1999999999999993": 318,
      "TIME_DELTA=0.9499999999999993": 319,
      "TIME_DELTA=0.33333333333333215": 320,
      "TIME_DELTA=3.7666666666666657": 321,
      "TIME_DELTA=1.0416666666666667": 322,
      "TIME_DELTA=0.10000000000000009": 323,
      "TIME_DELTA=0.6": 324,
      "TIME_DELTA=1.328125": 325,
      "TIME_DELTA=0.6000000000000001": 326,
      "TIME_DELTA=1.3": 327,
      "NOTE_OFF=93": 328,
      "NOTE_ON=93": 329,
      "TIME_DELTA=0.5833333333333334": 330,
      "TIME_DELTA=1.2": 331,
      "TIME_DELTA=0.29166666666666663": 332,
      "NOTE_OFF=29": 333,
      "NOTE_ON=29": 334,
      "TIME_DELTA=0.9000000000000004": 335,
      "TIME_DELTA=5.958333333333333": 336,
      "TIME_DELTA=1.479166666666666": 337,
      "TIME_DELTA=0.7083333333333334": 338,
      "TIME_DELTA=0.484375": 339,
      "TIME_DELTA=1.979166666666666": 340,
      "TIME_DELTA=0.20833333333333348": 341,
      "TIME_DELTA=3.7666666666666666": 342,
      "TIME_DELTA=1.041666666666667": 343,
      "TIME_SIGNATURE=2_4": 344,
      "TIME_DELTA=0.6999999999999993": 345,
      "TIME_DELTA=0.885416666666667": 346,
      "TIME_DELTA=1.979166666666667": 347,
      "TIME_DELTA=0.671875": 348,
      "TIME_DELTA=4.083333333333334": 349,
      "TIME_DELTA=1.114583333333333": 350,
      "TIME_DELTA=2.8": 351,
      "TIME_DELTA=4.233333333333333": 352,
      "TIME_DELTA=10.0": 353,
      "NOTE_OFF=92": 354,
      "NOTE_ON=92": 355,
      "TIME_DELTA=1.9500000000000002": 356,
      "NOTE_OFF=30": 357,
      "NOTE_ON=30": 358,
      "TIME_DELTA=2.041666666666666": 359,
      "TIME_DELTA=0.6666666666666667": 360,
      "TIME_DELTA=1.2916666666666665": 361,
      "TIME_DELTA=0.9333333333333336": 362,
      "TIME_DELTA=0.20833333333333393": 363,
      "TIME_DELTA=3.1999999999999993": 364,
      "TIME_DELTA=1.9333333333333333": 365,
      "TIME_SIGNATURE=2_2": 366,
      "TIME_DELTA=1.9625000000000004": 367,
      "TIME_DELTA=2.416666666666666": 368,
      "TIME_DELTA=1.3359375": 369,
      "TIME_DELTA=0.515625": 370,
      "TIME_DELTA=0.33333333333333326": 371,
      "TIME_DELTA=5.0": 372,
      "TIME_DELTA=2.9166666666666665": 373,
      "TIME_DELTA=0.4375": 374,
      "TIME_DELTA=1.9499999999999993": 375,
      "TIME_DELTA=0.29166666666666785": 376,
      "TIME_DELTA=14.0": 377,
      "TIME_DELTA=5.333333333333332": 378,
      "TIME_DELTA=0.03750000000000009": 379,
      "TIME_DELTA=2.0666666666666664": 380,
      "TIME_DELTA=2.4": 381,
      "TIME_DELTA=4.083333333333333": 382,
      "TIME_DELTA=0.8666666666666667": 383,
      "TIME_DELTA=0.4583333333333333": 384,
      "TIME_DELTA=0.08333333333333333": 385,
      "TIME_DELTA=0.65625": 386,
      "TIME_DELTA=1.583333333333334": 387,
      "TIME_DELTA=0.049999999999998934": 388,
      "TIME_DELTA=0.19999999999999996": 389,
      "TIME_DELTA=5.958333333333332": 390,
      "TIME_DELTA=0.4": 391,
      "TIME_DELTA=0.16666666666666666": 392,
      "TIME_DELTA=0.6249999999999991": 393,
      "TIME_DELTA=0.8333333333333339": 394,
      "TIME_DELTA=0.15000000000000036": 395,
      "TIME_DELTA=3.95": 396,
      "TIME_DELTA=5.333333333333333": 397,
      "TIME_DELTA=7.916666666666668": 398,
      "TIME_DELTA=1.0833333333333335": 399,
      "TIME_DELTA=0.40625": 400,
      "TIME_DELTA=0.050000000000000044": 401,
      "TIME_DELTA=0.6249999999999996": 402,
      "TIME_DELTA=7.916666666666667": 403,
      "TIME_DELTA=1.7666666666666657": 404,
      "TIME_DELTA=0.025000000000000355": 405,
      "TIME_DELTA=0.4166666666666665": 406,
      "TIME_DELTA=11.958333333333334": 407,
      "TIME_DELTA=0.06666666666666665": 408,
      "TIME_DELTA=0.9166666666666666": 409,
      "TIME_DELTA=2.5": 410,
      "TIME_DELTA=3.958333333333332": 411,
      "TIME_DELTA=0.4499999999999993": 412,
      "TIME_DELTA=0.9166666666666665": 413,
      "TIME_DELTA=1.3083333333333333": 414,
      "TIME_DELTA=1.578125": 415,
      "TIME_DELTA=1.59375": 416,
      "TIME_DELTA=1.984375": 417,
      "TIME_DELTA=3.9625000000000004": 418,
      "TIME_DELTA=0.16666666666666785": 419,
      "TIME_DELTA=2.75": 420,
      "TIME_DELTA=1.34375": 421,
      "TIME_DELTA=0.41666666666666696": 422,
      "TIME_DELTA=0.5666666666666667": 423,
      "TIME_DELTA=0.39583333333333304": 424,
      "TIME_DELTA=1.2999999999999998": 425,
      "TIME_DELTA=0.3": 426,
      "TIME_DELTA=1.9000000000000004": 427,
      "TIME_DELTA=2.625": 428,
      "TIME_DELTA=0.45833333333333337": 429,
      "INST=45": 430,
      "TIME_DELTA=2.4000000000000004": 431,
      "TIME_DELTA=4.041666666666666": 432,
      "TIME_DELTA=0.8333333333333334": 433,
      "TIME_DELTA=0.02083333333333326": 434,
      "INST=68": 435,
      "INST=73": 436,
      "TIME_DELTA=0.5208333333333339": 437,
      "TIME_DELTA=0.5333333333333332": 438,
      "TIME_DELTA=0.95": 439,
      "TIME_DELTA=1.1145833333333335": 440,
      "TIME_DELTA=1.708333333333334": 441,
      "TIME_DELTA=1.4791666666666667": 442,
      "TIME_DELTA=0.6249999999999999": 443,
      "TIME_DELTA=3.9499999999999993": 444,
      "TIME_DELTA=0.20833333333333326": 445,
      "TIME_DELTA=3.75": 446,
      "TIME_DELTA=0.1": 447,
      "TIME_DELTA=0.5208333333333333": 448,
      "TIME_DELTA=5.25": 449,
      "TIME_DELTA=15.958333333333334": 450,
      "TIME_DELTA=0.06666666666666667": 451,
      "TIME_DELTA=0.5416666666666665": 452,
      "TIME_DELTA=1.1666666666666667": 453,
      "TIME_DELTA=1.5833333333333335": 454,
      "TIME_DELTA=0.041666666666666685": 455,
      "TIME_DELTA=1.166666666666666": 456,
      "TIME_DELTA=1.3000000000000007": 457,
      "TIME_DELTA=4.041666666666667": 458,
      "TIME_DELTA=0.5833333333333321": 459,
      "NOTE_OFF=94": 460,
      "NOTE_ON=94": 461,
      "TIME_DELTA=1.95": 462,
      "TIME_DELTA=0.9625000000000004": 463,
      "TIME_DELTA=3.25": 464,
      "TIME_DELTA=3.116666666666667": 465,
      "TIME_DELTA=0.796875": 466,
      "TIME_DELTA=1.9791666666666667": 467,
      "TIME_DELTA=4.5": 468,
      "TIME_DELTA=2.4166666666666665": 469,
      "TIME_DELTA=0.4166666666666667": 470,
      "TIME_DELTA=0.21666666666666667": 471,
      "TIME_DELTA=3.708333333333334": 472,
      "TIME_DELTA=0.833333333333333": 473,
      "TIME_DELTA=11.0": 474,
      "TIME_DELTA=0.16666666666666674": 475,
      "TIME_DELTA=0.29166666666666674": 476,
      "TIME_DELTA=0.9375": 477,
      "TIME_DELTA=0.43333333333333335": 478,
      "TIME_DELTA=15.916666666666666": 479,
      "TIME_DELTA=2.229166666666667": 480,
      "TIME_DELTA=0.203125": 481,
      "TIME_DELTA=0.7": 482,
      "TIME_DELTA=1.9999999999999991": 483,
      "TIME_DELTA=2.8000000000000007": 484,
      "TIME_DELTA=0.390625": 485,
      "TIME_DELTA=1.666666666666666": 486,
      "TIME_DELTA=0.109375": 487,
      "TIME_DELTA=1.3333333333333321": 488,
      "TIME_DELTA=3.9625": 489,
      "TIME_SIGNATURE=6_8": 490,
      "TIME_DELTA=0.5333333333333333": 491,
      "TIME_DELTA=1.770833333333334": 492,
      "TIME_DELTA=1.9583333333333335": 493,
      "TIME_DELTA=7.5": 494,
      "TIME_DELTA=7.833333333333332": 495,
      "TIME_DELTA=3.333333333333332": 496,
      "TIME_DELTA=2.015625": 497,
      "TIME_DELTA=0.8854166666666665": 498,
      "TIME_DELTA=0.8499999999999996": 499,
      "TIME_DELTA=2.2333333333333334": 500,
      "TIME_DELTA=2.2666666666666666": 501,
      "TIME_DELTA=3.958333333333333": 502,
      "TIME_DELTA=0.08333333333333337": 503,
      "TIME_DELTA=1.375": 504,
      "TIME_DELTA=0.13333333333333375": 505,
      "GENRE=CLASSICAL": 506,
      "TIME_DELTA=0.7333333333333334": 507,
      "TIME_DELTA=0.9999999999999998": 508,
      "NOTE_OFF=26": 509,
      "NOTE_ON=26": 510,
      "TIME_DELTA=4.666666666666666": 511,
      "NOTE_OFF=27": 512,
      "NOTE_ON=27": 513,
      "TIME_DELTA=4.000000000000001": 514,
      "TIME_DELTA=4.8": 515,
      "TIME_DELTA=5.5": 516,
      "TIME_DELTA=3.7083333333333335": 517,
      "TIME_DELTA=0.21666666666666679": 518,
      "TIME_DELTA=0.5833333333333333": 519,
      "TIME_DELTA=1.770833333333333": 520,
      "TIME_DELTA=0.2": 521,
      "TIME_DELTA=1.4166666666666667": 522,
      "INST=6": 523,
      "TIME_DELTA=0.0625": 524,
      "TIME_DELTA=0.2833333333333333": 525,
      "TIME_DELTA=1.166666666666667": 526,
      "TIME_DELTA=0.3958333333333339": 527,
      "TIME_DELTA=0.1875": 528,
      "TIME_DELTA=1.604166666666667": 529,
      "TIME_DELTA=0.025": 530,
      "TIME_DELTA=0.8999999999999999": 531,
      "TIME_DELTA=0.9166666666666667": 532,
      "TIME_DELTA=1.8499999999999996": 533,
      "NOTE_OFF=96": 534,
      "NOTE_ON=96": 535,
      "TIME_DELTA=1.3083333333333336": 536,
      "TIME_DELTA=2.541666666666667": 537,
      "TIME_DELTA=6.4": 538,
      "TIME_DELTA=0.9500000000000011": 539,
      "TIME_DELTA=0.30000000000000004": 540,
      "TIME_DELTA=0.5625": 541,
      "NOTE_OFF=28": 542,
      "NOTE_ON=28": 543,
      "NOTE_OFF=95": 544,
      "NOTE_ON=95": 545,
      "TIME_DELTA=0.02083333333333348": 546,
      "TIME_DELTA=0.45833333333333215": 547,
      "TIME_DELTA=0.016666666666666607": 548,
      "TIME_DELTA=15.0": 549,
      "TIME_DELTA=2.125": 550,
      "TIME_DELTA=0.13333333333333333": 551,
      "TIME_DELTA=1.9625": 552,
      "TIME_DELTA=2.083333333333333": 553,
      "TIME_DELTA=0.4500000000000002": 554,
      "TIME_DELTA=0.15": 555,
      "TIME_DELTA=0.791666666666667": 556,
      "TIME_SIGNATURE=9_8": 557,
      "TIME_DELTA=1.666666666666667": 558,
      "TIME_DELTA=1.9166666666666665": 559,
      "TIME_DELTA=0.016666666666667496": 560,
      "TIME_DELTA=0.10000000000000053": 561,
      "TIME_DELTA=0.9333333333333333": 562,
      "TIME_DELTA=1.604166666666666": 563,
      "TIME_DELTA=0.328125": 564,
      "TIME_DELTA=0.34375": 565,
      "TIME_DELTA=0.8125": 566,
      "TIME_DELTA=1.2500000000000009": 567,
      "TIME_DELTA=6.233333333333333": 568,
      "TIME_DELTA=0.20833333333333334": 569,
      "TIME_DELTA=0.36666666666666664": 570,
      "TIME_DELTA=11.916666666666666": 571,
      "TIME_DELTA=1.8833333333333329": 572,
      "TIME_DELTA=0.9666666666666668": 573,
      "TIME_DELTA=1.4583333333333335": 574,
      "TIME_DELTA=0.33333333333333337": 575,
      "TIME_DELTA=1.125": 576,
      "TIME_DELTA=1.7708333333333333": 577,
      "TIME_DELTA=1.625": 578,
      "TIME_DELTA=1.9666666666666666": 579,
      "TIME_DELTA=0.171875": 580,
      "TIME_DELTA=0.5416666666666666": 581,
      "TIME_DELTA=0.9999999999999991": 582,
      "TIME_DELTA=3.1166666666666667": 583,
      "TIME_DELTA=2.65625": 584,
      "TIME_DELTA=3.9999999999999982": 585,
      "TIME_DELTA=0.8854166666666666": 586,
      "TIME_DELTA=11.766666666666667": 587,
      "TIME_DELTA=3.999999999999999": 588,
      "TIME_DELTA=2.671875": 589,
      "TIME_DELTA=0.050000000000000266": 590,
      "TIME_DELTA=1.7083333333333335": 591,
      "TIME_DELTA=1.9999999999999998": 592,
      "TIME_DELTA=0.20833333333333337": 593,
      "TIME_DELTA=0.22916666666666696": 594,
      "TIME_DELTA=2.083333333333334": 595,
      "TIME_DELTA=3.8333333333333335": 596,
      "TIME_DELTA=0.5000000000000004": 597,
      "TIME_DELTA=0.5416666666666679": 598,
      "TIME_DELTA=0.7666666666666667": 599,
      "TIME_DELTA=6.041666666666667": 600,
      "TIME_DELTA=7.999999999999999": 601,
      "TIME_DELTA=1.9": 602,
      "TIME_DELTA=2.0416666666666665": 603,
      "TIME_DELTA=3.1875": 604,
      "TIME_DELTA=0.7333333333333343": 605,
      "TIME_DELTA=3.1666666666666665": 606,
      "TIME_DELTA=0.2333333333333334": 607,
      "TIME_DELTA=0.5833333333333335": 608,
      "TIME_DELTA=0.34999999999999964": 609,
      "TIME_DELTA=0.6250000000000018": 610,
      "TIME_DELTA=0.9999999999999996": 611,
      "TIME_DELTA=1.0000000000000009": 612,
      "TIME_DELTA=1.5625": 613,
      "TIME_DELTA=1.2500000000000002": 614,
      "TIME_DELTA=2.0999999999999996": 615,
      "TIME_DELTA=9.958333333333334": 616,
      "TIME_DELTA=0.015625": 617,
      "TIME_DELTA=2.666666666666667": 618,
      "TIME_DELTA=5.333333333333334": 619,
      "TIME_DELTA=1.541666666666666": 620,
      "TIME_DELTA=0.47916666666666696": 621,
      "TIME_DELTA=0.4999999999999982": 622,
      "TIME_DELTA=2.2666666666666657": 623,
      "TIME_DELTA=3.375": 624,
      "TIME_DELTA=0.421875": 625,
      "TIME_DELTA=0.6333333333333333": 626,
      "TIME_DELTA=0.6500000000000004": 627,
      "TIME_DELTA=0.02499999999999991": 628,
      "TIME_DELTA=0.06666666666666687": 629,
      "TIME_DELTA=0.9": 630,
      "TIME_DELTA=1.9749999999999996": 631,
      "TIME_DELTA=4.4": 632,
      "TIME_DELTA=0.02083333333333215": 633,
      "TIME_DELTA=10.5": 634,
      "TIME_DELTA=0.78125": 635,
      "TIME_DELTA=0.9999999999999982": 636,
      "TIME_DELTA=0.14999999999999858": 637,
      "TIME_DELTA=0.41666666666666785": 638,
      "TIME_DELTA=2.421875": 639,
      "TIME_DELTA=3.0416666666666665": 640,
      "TIME_DELTA=5.75": 641,
      "TIME_DELTA=0.7916666666666666": 642,
      "TIME_DELTA=1.1": 643,
      "TIME_DELTA=4.800000000000001": 644,
      "TIME_DELTA=8.666666666666666": 645,
      "INST=43": 646,
      "TIME_DELTA=0.9999999999999999": 647,
      "TIME_DELTA=1.1102230246251565e-16": 648,
      "TIME_DELTA=9.0": 649,
      "TIME_DELTA=0.36666666666666714": 650,
      "TIME_DELTA=1.083333333333333": 651,
      "TIME_DELTA=3.333333333333333": 652,
      "TIME_DELTA=0.23333333333333428": 653,
      "TIME_DELTA=1.4583333333333321": 654,
      "TIME_DELTA=3.9749999999999996": 655,
      "TIME_DELTA=7.833333333333333": 656,
      "TIME_DELTA=0.20000000000000107": 657,
      "TIME_DELTA=0.4791666666666661": 658,
      "TIME_DELTA=1.2333333333333334": 659,
      "TIME_DELTA=1.3749999999999996": 660,
      "TIME_DELTA=7.333333333333333": 661,
      "TIME_DELTA=7.766666666666667": 662,
      "TIME_SIGNATURE=3_8": 663,
      "TIME_DELTA=0.20833333333333215": 664,
      "TIME_DELTA=0.39583333333333326": 665,
      "TIME_DELTA=0.9833333333333334": 666,
      "TIME_DELTA=1.3291666666666666": 667,
      "TIME_DELTA=1.6666666666666667": 668,
      "TIME_DELTA=3.979166666666666": 669,
      "TIME_DELTA=6.5": 670,
      "TIME_DELTA=0.265625": 671,
      "TIME_DELTA=0.5000000000000009": 672,
      "TIME_DELTA=0.7916666666666679": 673,
      "TIME_DELTA=1.3375": 674,
      "TIME_DELTA=1.6666666666666665": 675,
      "TIME_DELTA=1.6666666666666679": 676,
      "TIME_DELTA=7.75": 677,
      "TIME_DELTA=9.75": 678,
      "TIME_DELTA=0.15625": 679,
      "TIME_DELTA=0.4791666666666665": 680,
      "TIME_DELTA=0.6833333333333333": 681,
      "TIME_DELTA=0.7916666666666661": 682,
      "TIME_DELTA=0.9333333333333327": 683,
      "TIME_DELTA=0.9499999999999997": 684,
      "TIME_DELTA=1.0999999999999996": 685,
      "TIME_DELTA=1.1666666666666665": 686,
      "TIME_DELTA=2.229166666666666": 687,
      "TIME_DELTA=3.8": 688,
      "TIME_DELTA=8.233333333333333": 689,
      "TIME_DELTA=0.06666666666666732": 690,
      "TIME_DELTA=0.29999999999999893": 691,
      "TIME_DELTA=0.9833333333333325": 692,
      "TIME_DELTA=1.2499999999999998": 693,
      "TIME_DELTA=2.3333333333333335": 694,
      "TIME_DELTA=5.916666666666667": 695,
      "TIME_DELTA=0.11666666666666714": 696,
      "TIME_DELTA=0.26666666666666683": 697,
      "TIME_DELTA=0.4666666666666668": 698,
      "TIME_DELTA=3.041666666666666": 699,
      "TIME_DELTA=4.25": 700,
      "TIME_DELTA=7.375": 701,
      "TIME_DELTA=0.16666666666666663": 702,
      "TIME_DELTA=0.22916666666666652": 703,
      "TIME_DELTA=0.9624999999999999": 704,
      "TIME_DELTA=1.3750000000000002": 705,
      "TIME_DELTA=2.000000000000001": 706,
      "TIME_DELTA=5.066666666666666": 707,
      "TIME_DELTA=5.291666666666667": 708,
      "TIME_DELTA=0.8958333333333339": 709,
      "TIME_DELTA=2.9999999999999982": 710,
      "TIME_DELTA=0.3500000000000001": 711,
      "TIME_DELTA=0.7666666666666666": 712,
      "TIME_DELTA=1.6015625": 713,
      "TIME_DELTA=0.1499999999999999": 714,
      "TIME_DELTA=0.5000000000000018": 715,
      "TIME_DELTA=0.546875": 716,
      "TIME_DELTA=0.8500000000000001": 717,
      "TIME_DELTA=1.0416666666666679": 718,
      "TIME_DELTA=1.9666666666666668": 719,
      "TIME_DELTA=6.083333333333334": 720,
      "TIME_DELTA=0.59375": 721,
      "TIME_DELTA=0.8333333333333335": 722,
      "TIME_DELTA=2.2333333333333343": 723,
      "TIME_DELTA=0.2833333333333332": 724,
      "TIME_DELTA=1.1875": 725,
      "TIME_DELTA=1.4375": 726,
      "TIME_DELTA=1.8000000000000007": 727,
      "TIME_DELTA=1.833333333333334": 728,
      "TIME_DELTA=1.8500000000000014": 729,
      "TIME_DELTA=5.916666666666668": 730,
      "TIME_DELTA=0.234375": 731,
      "TIME_DELTA=0.2500000000000009": 732,
      "TIME_DELTA=1.21875": 733,
      "TIME_DELTA=1.541666666666667": 734,
      "TIME_DELTA=3.0833333333333335": 735,
      "TIME_DELTA=3.2083333333333335": 736,
      "TIME_DELTA=4.1": 737,
      "TIME_DELTA=0.10000000000000142": 738,
      "TIME_DELTA=0.49999999999999956": 739,
      "TIME_DELTA=0.5333333333333337": 740,
      "TIME_DELTA=0.7499999999999999": 741,
      "TIME_DELTA=9.333333333333334": 742,
      "TIME_SIGNATURE=6_4": 743,
      "TIME_DELTA=0.016666666666666666": 744,
      "TIME_DELTA=0.04999999999999999": 745,
      "TIME_DELTA=0.22916666666666607": 746,
      "TIME_DELTA=0.3125": 747,
      "TIME_DELTA=0.41666666666666674": 748,
      "TIME_DELTA=0.4999999999999999": 749,
      "TIME_DELTA=1.0000000000000002": 750,
      "TIME_DELTA=1.791666666666667": 751,
      "TIME_DELTA=1.85": 752,
      "TIME_DELTA=2.033333333333333": 753,
      "TIME_DELTA=2.0833333333333335": 754,
      "TIME_DELTA=3.083333333333334": 755,
      "TIME_DELTA=4.958333333333332": 756,
      "TIME_DELTA=0.033333333333333326": 757,
      "TIME_DELTA=0.3541666666666661": 758,
      "TIME_DELTA=0.6458333333333339": 759,
      "TIME_DELTA=1.6041666666666667": 760,
      "TIME_DELTA=0.24999999999999978": 761,
      "TIME_DELTA=0.4833333333333334": 762,
      "TIME_DELTA=0.9166666666666679": 763,
      "TIME_DELTA=1.8": 764,
      "TIME_DELTA=2.05": 765,
      "TIME_DELTA=0.13333333333333464": 766,
      "TIME_DELTA=0.19166666666666643": 767,
      "TIME_DELTA=0.28125": 768,
      "TIME_DELTA=0.39999999999999947": 769,
      "TIME_DELTA=0.7333333333333333": 770,
      "TIME_DELTA=1.1333333333333333": 771,
      "TIME_DELTA=1.2083333333333333": 772,
      "TIME_DELTA=1.5416666666666665": 773,
      "TIME_DELTA=1.5833333333333333": 774,
      "TIME_DELTA=1.7083333333333333": 775,
      "TIME_DELTA=1.9999999999999996": 776,
      "TIME_DELTA=15.5": 777,
      "TIME_DELTA=2.375": 778,
      "TIME_DELTA=2.9000000000000004": 779,
      "TIME_DELTA=3.208333333333333": 780,
      "TIME_DELTA=5.291666666666668": 781,
      "TIME_DELTA=6.041666666666666": 782,
      "TIME_DELTA=6.958333333333333": 783,
      "TIME_DELTA=9.733333333333333": 784,
      "TIME_DELTA=0.03333333333333366": 785,
      "TIME_DELTA=0.31666666666666643": 786,
      "TIME_DELTA=0.6499999999999999": 787,
      "TIME_DELTA=11.5": 788,
      "TIME_DELTA=3.4333333333333336": 789,
      "TIME_DELTA=7.333333333333332": 790,
      "TIME_DELTA=7.9625": 791,
      "TIME_DELTA=8.233333333333334": 792,
      "TIME_DELTA=0.10416666666666607": 793,
      "TIME_DELTA=0.41666666666666663": 794,
      "TIME_DELTA=0.44999999999999996": 795,
      "TIME_DELTA=0.9333333333333331": 796,
      "TIME_DELTA=0.9791666666666661": 797,
      "TIME_DELTA=1.0625": 798,
      "TIME_DELTA=1.5416666666666679": 799,
      "TIME_DELTA=8.041666666666666": 800,
      "TIME_SIGNATURE=4_8": 801,
      "TIME_DELTA=0.3750000000000009": 802,
      "TIME_DELTA=0.45": 803,
      "TIME_DELTA=1.8333333333333333": 804,
      "TIME_DELTA=4.291666666666666": 805,
      "TIME_DELTA=0.08333333333333331": 806,
      "TIME_DELTA=0.1166666666666667": 807,
      "TIME_DELTA=0.16666666666666669": 808,
      "TIME_DELTA=0.22916666666666674": 809,
      "TIME_DELTA=0.2333333333333325": 810,
      "TIME_DELTA=0.3958333333333335": 811,
      "TIME_DELTA=0.85": 812,
      "TIME_DELTA=1.5666666666666667": 813,
      "TIME_DELTA=11.333333333333334": 814,
      "NOTE_OFF=98": 815,
      "NOTE_ON=98": 816,
      "TIME_DELTA=0.09999999999999999": 817,
      "TIME_DELTA=0.604166666666667": 818,
      "TIME_DELTA=1.2500000000000018": 819,
      "TIME_DELTA=1.708333333333333": 820,
      "TIME_DELTA=2.958333333333332": 821,
      "TIME_DELTA=6.958333333333332": 822,
      "TIME_DELTA=0.35": 823,
      "TIME_DELTA=0.4666666666666667": 824,
      "TIME_DELTA=0.4999999999999991": 825,
      "TIME_DELTA=0.7916666666666665": 826,
      "TIME_DELTA=1.833333333333333": 827,
      "TIME_DELTA=18.0": 828,
      "TIME_DELTA=2.116666666666667": 829,
      "TIME_DELTA=2.333333333333334": 830,
      "TIME_DELTA=3.208333333333332": 831,
      "TIME_DELTA=3.625": 832,
      "TIME_DELTA=5.116666666666667": 833,
      "TIME_DELTA=8.083333333333334": 834,
      "TIME_DELTA=9.916666666666666": 835,
      "TIME_DELTA=0.0416666666666643": 836,
      "TIME_DELTA=0.12499999999999956": 837,
      "TIME_DELTA=0.18333333333333357": 838,
      "TIME_DELTA=0.21875": 839,
      "TIME_DELTA=0.7999999999999989": 840,
      "TIME_DELTA=0.8999999999999995": 841,
      "TIME_DELTA=1.1666666666666679": 842,
      "TIME_DELTA=1.8999999999999986": 843,
      "TIME_DELTA=10.041666666666666": 844,
      "TIME_DELTA=2.4375": 845,
      "TIME_DELTA=2.66796875": 846,
      "TIME_DELTA=4.05": 847,
      "TIME_DELTA=9.4": 848,
      "NOTE_OFF=97": 849,
      "NOTE_ON=97": 850,
      "TIME_DELTA=0.35000000000000053": 851,
      "TIME_DELTA=0.4999999999999998": 852,
      "TIME_DELTA=1.2666666666666666": 853,
      "TIME_DELTA=1.4166666666666679": 854,
      "TIME_DELTA=1.791666666666666": 855,
      "TIME_DELTA=15.666666666666666": 856,
      "TIME_DELTA=2.9333333333333336": 857,
      "TIME_DELTA=3.583333333333332": 858,
      "TIME_DELTA=4.666666666666667": 859,
      "NOTE_OFF=24": 860,
      "NOTE_ON=24": 861,
      "TIME_DELTA=0.024999999999999467": 862,
      "TIME_DELTA=0.09999999999999998": 863,
      "TIME_DELTA=0.5333333333333334": 864,
      "TIME_DELTA=0.6875": 865,
      "TIME_DELTA=0.7083333333333333": 866,
      "TIME_DELTA=0.7916666666666667": 867,
      "TIME_DELTA=1.05": 868,
      "TIME_DELTA=1.354166666666666": 869,
      "TIME_DELTA=1.8999999999999995": 870,
      "TIME_DELTA=1.950000000000001": 871,
      "TIME_DELTA=1.975": 872,
      "TIME_DELTA=2.9625000000000004": 873,
      "TIME_DELTA=3.4375": 874,
      "TIME_DELTA=3.6": 875,
      "TIME_DELTA=4.229166666666667": 876,
      "TIME_DELTA=4.875": 877,
      "TIME_DELTA=5.6": 878,
      "TIME_DELTA=6.8": 879,
      "TIME_DELTA=8.1": 880,
      "NOTE_OFF=100": 881,
      "NOTE_ON=100": 882,
      "TIME_DELTA=0.3666666666666667": 883,
      "TIME_DELTA=0.5291666666666667": 884,
      "TIME_DELTA=0.5500000000000007": 885,
      "TIME_DELTA=0.65": 886,
      "TIME_DELTA=0.8958333333333335": 887,
      "TIME_DELTA=1.0833333333333333": 888,
      "TIME_DELTA=1.7999999999999998": 889,
      "TIME_DELTA=11.733333333333333": 890,
      "TIME_DELTA=2.0374999999999996": 891,
      "TIME_DELTA=6.333333333333333": 892,
      "TIME_DELTA=7.6": 893,
      "NOTE_OFF=99": 894,
      "NOTE_ON=99": 895,
      "TIME_DELTA=0.04166666666666666": 896,
      "TIME_DELTA=0.19999999999999973": 897,
      "TIME_DELTA=0.20833333333333331": 898,
      "TIME_DELTA=0.21666666666666856": 899,
      "TIME_DELTA=0.8500000000000014": 900,
      "TIME_DELTA=0.9500000000000001": 901,
      "TIME_DELTA=0.979166666666667": 902,
      "TIME_DELTA=1.5416666666666667": 903,
      "TIME_DELTA=1.65": 904,
      "TIME_DELTA=1.6999999999999993": 905,
      "TIME_DELTA=1.7333333333333325": 906,
      "TIME_DELTA=10.708333333333334": 907,
      "TIME_DELTA=3.041666666666667": 908,
      "TIME_DELTA=3.966666666666667": 909,
      "TIME_DELTA=4.421875": 910,
      "TIME_DELTA=6.666666666666666": 911,
      "TIME_DELTA=6.666666666666667": 912,
      "TIME_DELTA=6.708333333333333": 913,
      "TIME_DELTA=0.47499999999999964": 914,
      "TIME_DELTA=1.0500000000000007": 915,
      "TIME_DELTA=1.7": 916,
      "TIME_DELTA=1.8833333333333333": 917,
      "TIME_DELTA=6.25": 918,
      "TIME_DELTA=7.333333333333334": 919,
      "TIME_DELTA=0.15000000000000002": 920,
      "TIME_DELTA=0.18333333333333332": 921,
      "TIME_DELTA=0.3500000000000014": 922,
      "TIME_DELTA=0.4833333333333325": 923,
      "TIME_DELTA=0.6249999999999982": 924,
      "TIME_DELTA=0.8333333333333333": 925,
      "TIME_DELTA=1.2083333333333321": 926,
      "TIME_DELTA=1.208333333333334": 927,
      "TIME_DELTA=2.933333333333333": 928,
      "TIME_DELTA=3.114583333333334": 929,
      "TIME_DELTA=3.583333333333334": 930,
      "TIME_DELTA=3.7333333333333334": 931,
      "TIME_DELTA=3.8000000000000007": 932,
      "TIME_DELTA=4.958333333333333": 933,
      "TIME_DELTA=5.733333333333334": 934,
      "TIME_DELTA=9.6": 935,
      "TIME_SIGNATURE=8_8": 936,
      "TIME_DELTA=0.11666666666666625": 937,
      "TIME_DELTA=0.140625": 938,
      "TIME_DELTA=0.14583333333333393": 939,
      "TIME_DELTA=0.25000000000000044": 940,
      "TIME_DELTA=0.26666666666666705": 941,
      "TIME_DELTA=0.39583333333333215": 942,
      "TIME_DELTA=0.47916666666666674": 943,
      "TIME_DELTA=0.55": 944,
      "TIME_DELTA=0.6333333333333329": 945,
      "TIME_DELTA=0.6458333333333334": 946,
      "TIME_DELTA=0.7000000000000011": 947,
      "TIME_DELTA=0.7666666666666675": 948,
      "TIME_DELTA=1.8333333333333335": 949,
      "TIME_DELTA=10.083333333333334": 950,
      "TIME_DELTA=2.6249999999999996": 951,
      "TIME_DELTA=2.9": 952,
      "TIME_DELTA=3.114583333333333": 953,
      "TIME_DELTA=3.195833333333333": 954,
      "TIME_DELTA=3.433333333333333": 955,
      "TIME_DELTA=3.5625": 956,
      "TIME_DELTA=5.041666666666666": 957,
      "TIME_DELTA=5.041666666666667": 958,
      "TIME_DELTA=5.999999999999998": 959,
      "TIME_DELTA=6.3984375": 960,
      "TIME_DELTA=8.041666666666668": 961,
      "TIME_DELTA=8.5": 962,
      "NOTE_OFF=25": 963,
      "NOTE_ON=25": 964,
      "TIME_DELTA=0.0666666666666682": 965,
      "TIME_DELTA=0.10416666666666696": 966,
      "TIME_DELTA=0.175": 967,
      "TIME_DELTA=0.24999999999999956": 968,
      "TIME_DELTA=0.53125": 969,
      "TIME_DELTA=0.8750000000000002": 970,
      "TIME_DELTA=0.9333333333333332": 971,
      "TIME_DELTA=0.9374999999999998": 972,
      "TIME_DELTA=1.0000000000000004": 973,
      "TIME_DELTA=1.109375": 974,
      "TIME_DELTA=1.208333333333333": 975,
      "TIME_DELTA=1.2499999999999991": 976,
      "TIME_DELTA=1.2500000000000004": 977,
      "TIME_DELTA=1.3750000000000009": 978,
      "TIME_DELTA=1.7666666666666675": 979,
      "TIME_DELTA=11.041666666666666": 980,
      "TIME_DELTA=2.1166666666666667": 981,
      "TIME_DELTA=2.499999999999999": 982,
      "TIME_DELTA=3.1333333333333333": 983,
      "TIME_DELTA=3.4583333333333335": 984,
      "TIME_DELTA=3.583333333333333": 985,
      "TIME_DELTA=3.666666666666666": 986,
      "TIME_DELTA=5.4": 987,
      "TIME_DELTA=5.458333333333334": 988,
      "TIME_DELTA=7.041666666666667": 989,
      "TIME_DELTA=7.9": 990,
      "TIME_DELTA=0.01666666666666572": 991,
      "TIME_DELTA=0.02083333333333337": 992,
      "TIME_DELTA=0.0333333333333341": 993,
      "TIME_DELTA=0.14583333333333304": 994,
      "TIME_DELTA=0.216666666666665": 995,
      "TIME_DELTA=0.4374999999999999": 996,
      "TIME_DELTA=0.6250000000000002": 997,
      "TIME_DELTA=0.7166666666666668": 998,
      "TIME_DELTA=0.8333333333333321": 999,
      "TIME_DELTA=1.0833333333333321": 1000,
      "TIME_DELTA=1.8666666666666663": 1001,
      "TIME_DELTA=2.0000000000000004": 1002,
      "TIME_DELTA=2.4999999999999982": 1003,
      "TIME_DELTA=2.875": 1004,
      "TIME_DELTA=2.9625": 1005,
      "TIME_DELTA=3.1145833333333335": 1006,
      "TIME_DELTA=3.458333333333334": 1007,
      "TIME_DELTA=3.541666666666666": 1008,
      "TIME_DELTA=3.5833333333333335": 1009,
      "TIME_DELTA=3.5999999999999996": 1010,
      "TIME_DELTA=5.949999999999999": 1011,
      "INST=53": 1012,
      "NOTE_OFF=103": 1013,
      "NOTE_ON=103": 1014,
      "TIME_DELTA=0.10416666666666652": 1015,
      "TIME_DELTA=0.22916666666666785": 1016,
      "TIME_DELTA=0.30000000000000027": 1017,
      "TIME_DELTA=0.6000000000000005": 1018,
      "TIME_DELTA=0.6166666666666654": 1019,
      "TIME_DELTA=1.4166666666666665": 1020,
      "TIME_DELTA=1.4333333333333333": 1021,
      "TIME_DELTA=1.4666666666666666": 1022,
      "TIME_DELTA=1.7000000000000002": 1023,
      "TIME_DELTA=1.9499999999999997": 1024,
      "TIME_DELTA=14.75": 1025,
      "TIME_DELTA=2.208333333333333": 1026,
      "TIME_DELTA=2.541666666666666": 1027,
      "TIME_DELTA=2.6249999999999982": 1028,
      "TIME_DELTA=2.6640625": 1029,
      "TIME_DELTA=2.7": 1030,
      "TIME_DELTA=2.7083333333333335": 1031,
      "TIME_DELTA=3.541666666666667": 1032,
      "TIME_DELTA=3.6666666666666665": 1033,
      "TIME_DELTA=3.7333333333333343": 1034,
      "TIME_DELTA=4.75": 1035,
      "TIME_DELTA=5.520833333333332": 1036,
      "TIME_DELTA=5.666666666666667": 1037,
      "TIME_DELTA=5.999999999999999": 1038,
      "TIME_DELTA=7.916666666666666": 1039,
      "TIME_DELTA=0.06666666666666668": 1040,
      "TIME_DELTA=0.11666666666666667": 1041,
      "TIME_DELTA=0.21666666666666656": 1042,
      "TIME_DELTA=0.2499999999999991": 1043,
      "TIME_DELTA=0.27083333333333304": 1044,
      "TIME_DELTA=0.2916666666666643": 1045,
      "TIME_DELTA=0.45000000000000107": 1046,
      "TIME_DELTA=0.6041666666666661": 1047,
      "TIME_DELTA=0.6041666666666667": 1048,
      "TIME_DELTA=0.80078125": 1049,
      "TIME_DELTA=0.8750000000000009": 1050,
      "TIME_DELTA=0.9666666666666667": 1051,
      "TIME_DELTA=0.9833333333333333": 1052,
      "TIME_DELTA=1.0625000000000009": 1053,
      "TIME_DELTA=1.06640625": 1054,
      "TIME_DELTA=1.1250000000000009": 1055,
      "TIME_DELTA=1.4333333333333336": 1056,
      "TIME_DELTA=1.6499999999999995": 1057,
      "TIME_DELTA=1.8125": 1058,
      "TIME_DELTA=1.895833333333334": 1059,
      "TIME_DELTA=11.95": 1060,
      "TIME_DELTA=13.5": 1061,
      "TIME_DELTA=13.958333333333334": 1062,
      "TIME_DELTA=2.291666666666666": 1063,
      "TIME_DELTA=2.566666666666667": 1064,
      "TIME_DELTA=3.875": 1065,
      "TIME_DELTA=4.266666666666667": 1066,
      "TIME_DELTA=4.8125": 1067,
      "TIME_DELTA=5.083333333333334": 1068,
      "TIME_DELTA=7.25": 1069,
      "TIME_DELTA=7.949999999999999": 1070,
      "TIME_DELTA=8.958333333333334": 1071,
      "NOTE_OFF=102": 1072,
      "NOTE_ON=102": 1073,
      "TIME_DELTA=0.01666666666666672": 1074,
      "TIME_DELTA=0.020833333333333315": 1075,
      "TIME_DELTA=0.296875": 1076,
      "TIME_DELTA=0.6166666666666667": 1077,
      "TIME_DELTA=0.6250000000000001": 1078,
      "TIME_DELTA=0.6250000000000004": 1079,
      "TIME_DELTA=0.66796875": 1080,
      "TIME_DELTA=0.7833333333333332": 1081,
      "TIME_DELTA=0.9749999999999996": 1082,
      "TIME_DELTA=1.049999999999999": 1083,
      "TIME_DELTA=1.0499999999999998": 1084,
      "TIME_DELTA=1.7916666666666667": 1085,
      "TIME_DELTA=1.966666666666666": 1086,
      "TIME_DELTA=1.9791666666666665": 1087,
      "TIME_DELTA=10.421875": 1088,
      "TIME_DELTA=11.75": 1089,
      "TIME_DELTA=11.9625": 1090,
      "TIME_DELTA=15.791666666666666": 1091,
      "TIME_DELTA=3.166666666666667": 1092,
      "TIME_DELTA=3.5416666666666665": 1093,
      "TIME_DELTA=3.8125": 1094,
      "TIME_DELTA=5.421875": 1095,
      "TIME_DELTA=5.541666666666667": 1096,
      "TIME_DELTA=5.875": 1097,
      "TIME_DELTA=6.229166666666667": 1098,
      "TIME_DELTA=7.116666666666667": 1099,
      "TIME_DELTA=7.458333333333333": 1100,
      "TIME_DELTA=7.95": 1101,
      "TIME_DELTA=8.883333333333333": 1102,
      "TIME_DELTA=0.1250000000000001": 1103,
      "TIME_DELTA=0.1250000000000009": 1104,
      "TIME_DELTA=0.1416666666666666": 1105,
      "TIME_DELTA=0.14583333333333348": 1106,
      "TIME_DELTA=0.14999999999999947": 1107,
      "TIME_DELTA=0.1666666666666643": 1108,
      "TIME_DELTA=0.18333333333333335": 1109,
      "TIME_DELTA=0.2166666666666659": 1110,
      "TIME_DELTA=0.35000000000000003": 1111,
      "TIME_DELTA=0.47916666666666785": 1112,
      "TIME_DELTA=0.6166666666666671": 1113,
      "TIME_DELTA=0.6499999999999995": 1114,
      "TIME_DELTA=0.71875": 1115,
      "TIME_DELTA=0.7833333333333333": 1116,
      "TIME_DELTA=0.8041666666666667": 1117,
      "TIME_DELTA=1.0374999999999996": 1118,
      "TIME_DELTA=1.078125": 1119,
      "TIME_DELTA=1.19921875": 1120,
      "TIME_DELTA=1.354166666666667": 1121,
      "TIME_DELTA=1.40625": 1122,
      "TIME_DELTA=1.45": 1123,
      "TIME_DELTA=1.5208333333333333": 1124,
      "TIME_DELTA=1.5333333333333332": 1125,
      "TIME_DELTA=1.645833333333334": 1126,
      "TIME_DELTA=1.966666666666665": 1127,
      "TIME_DELTA=10.875": 1128,
      "TIME_DELTA=12.233333333333333": 1129,
      "TIME_DELTA=2.066666666666667": 1130,
      "TIME_DELTA=2.583333333333334": 1131,
      "TIME_DELTA=3.1958333333333333": 1132,
      "TIME_DELTA=3.28125": 1133,
      "TIME_DELTA=3.291666666666666": 1134,
      "TIME_DELTA=3.4": 1135,
      "TIME_DELTA=3.883333333333333": 1136,
      "TIME_DELTA=3.975": 1137,
      "TIME_DELTA=4.0375": 1138,
      "TIME_DELTA=5.125": 1139,
      "TIME_DELTA=5.729166666666667": 1140,
      "TIME_DELTA=6.015625": 1141,
      "TIME_DELTA=6.266666666666667": 1142,
      "TIME_DELTA=7.666666666666667": 1143,
      "TIME_DELTA=7.733333333333333": 1144,
      "TIME_DELTA=9.5": 1145,
      "TIME_SIGNATURE=12_8": 1146,
      "TIME_DELTA=0.075": 1147,
      "TIME_DELTA=0.12500000000000022": 1148,
      "TIME_DELTA=0.20000000000000007": 1149,
      "TIME_DELTA=0.2083333333333357": 1150,
      "TIME_DELTA=0.21666666666666634": 1151,
      "TIME_DELTA=0.22916666666666663": 1152,
      "TIME_DELTA=0.24999999999999822": 1153,
      "TIME_DELTA=0.2708333333333339": 1154,
      "TIME_DELTA=0.3541666666666665": 1155,
      "TIME_DELTA=0.35416666666666696": 1156,
      "TIME_DELTA=0.4374999999999991": 1157,
      "TIME_DELTA=0.47916666666666663": 1158,
      "TIME_DELTA=0.5000000000000002": 1159,
      "TIME_DELTA=0.5375": 1160,
      "TIME_DELTA=0.6041666666666665": 1161,
      "TIME_DELTA=0.6333333333333337": 1162,
      "TIME_DELTA=0.6458333333333335": 1163,
      "TIME_DELTA=0.6666666666666643": 1164,
      "TIME_DELTA=0.7083333333333321": 1165,
      "TIME_DELTA=0.859375": 1166,
      "TIME_DELTA=0.8666666666666663": 1167,
      "TIME_DELTA=0.8749999999999998": 1168,
      "TIME_DELTA=1.1333333333333337": 1169,
      "TIME_DELTA=1.3541666666666665": 1170,
      "TIME_DELTA=1.4791666666666679": 1171,
      "TIME_DELTA=1.7708333333333321": 1172,
      "TIME_DELTA=1.7916666666666665": 1173,
      "TIME_DELTA=1.8333333333333321": 1174,
      "TIME_DELTA=1.8666666666666667": 1175,
      "TIME_DELTA=1.8666666666666671": 1176,
      "TIME_DELTA=1.9166666666666679": 1177,
      "TIME_DELTA=1.9666666666666663": 1178,
      "TIME_DELTA=10.666666666666666": 1179,
      "TIME_DELTA=15.333333333333334": 1180,
      "TIME_DELTA=15.458333333333334": 1181,
      "TIME_DELTA=15.95": 1182,
      "TIME_DELTA=2.208333333333334": 1183,
      "TIME_DELTA=2.333333333333333": 1184,
      "TIME_DELTA=2.4499999999999993": 1185,
      "TIME_DELTA=2.458333333333334": 1186,
      "TIME_DELTA=2.500000000000001": 1187,
      "TIME_DELTA=2.6": 1188,
      "TIME_DELTA=2.783333333333333": 1189,
      "TIME_DELTA=2.7916666666666665": 1190,
      "TIME_DELTA=3.083333333333333": 1191,
      "TIME_DELTA=3.21875": 1192,
      "TIME_DELTA=3.2916666666666665": 1193,
      "TIME_DELTA=3.552713678800501e-15": 1194,
      "TIME_DELTA=3.791666666666666": 1195,
      "TIME_DELTA=3.833333333333333": 1196,
      "TIME_DELTA=3.8499999999999996": 1197,
      "TIME_DELTA=4.541666666666666": 1198,
      "TIME_DELTA=5.708333333333334": 1199,
      "TIME_DELTA=5.95": 1200,
      "TIME_DELTA=9.116666666666667": 1201,
      "TIME_DELTA=9.291666666666666": 1202,
      "TIME_DELTA=0.03125": 1203,
      "TIME_DELTA=0.03333333333333344": 1204,
      "TIME_DELTA=0.04999999999999993": 1205,
      "TIME_DELTA=0.05000000000000002": 1206,
      "TIME_DELTA=0.078125": 1207,
      "TIME_DELTA=0.09375": 1208,
      "TIME_DELTA=0.09999999999999787": 1209,
      "TIME_DELTA=0.10000000000000003": 1210,
      "TIME_DELTA=0.10416666666666667": 1211,
      "TIME_DELTA=0.11666666666666536": 1212,
      "TIME_DELTA=0.12499999999999911": 1213,
      "TIME_DELTA=0.12499999999999978": 1214,
      "TIME_DELTA=0.12499999999999989": 1215,
      "TIME_DELTA=0.12500000000000044": 1216,
      "TIME_DELTA=0.20833333333333315": 1217,
      "TIME_DELTA=0.29999999999999716": 1218,
      "TIME_DELTA=0.3541666666666667": 1219,
      "TIME_DELTA=0.35416666666666674": 1220,
      "TIME_DELTA=0.38333333333333336": 1221,
      "TIME_DELTA=0.3999999999999986": 1222,
      "TIME_DELTA=0.40000000000000013": 1223,
      "TIME_DELTA=0.4791666666666667": 1224,
      "TIME_DELTA=0.5499999999999998": 1225,
      "TIME_DELTA=0.6041666666666666": 1226,
      "TIME_DELTA=0.645833333333333": 1227,
      "TIME_DELTA=0.7500000000000002": 1228,
      "TIME_DELTA=0.8000000000000003": 1229,
      "TIME_DELTA=1.0666666666666673": 1230,
      "TIME_DELTA=1.1166666666666663": 1231,
      "TIME_DELTA=1.1500000000000004": 1232,
      "TIME_DELTA=1.265625": 1233,
      "TIME_DELTA=1.3125": 1234,
      "TIME_DELTA=1.4374999999999982": 1235,
      "TIME_DELTA=1.4791666666666665": 1236,
      "TIME_DELTA=1.583333333333333": 1237,
      "TIME_DELTA=1.6000000000000005": 1238,
      "TIME_DELTA=1.6500000000000004": 1239,
      "TIME_DELTA=1.700000000000001": 1240,
      "TIME_DELTA=1.7499999999999996": 1241,
      "TIME_DELTA=1.7833333333333332": 1242,
      "TIME_DELTA=1.8499999999999999": 1243,
      "TIME_DELTA=13.0": 1244,
      "TIME_DELTA=17.958333333333332": 1245,
      "TIME_DELTA=2.041666666666668": 1246,
      "TIME_DELTA=2.1500000000000004": 1247,
      "TIME_DELTA=2.1666666666666665": 1248,
      "TIME_DELTA=2.2916666666666665": 1249,
      "TIME_DELTA=2.3499999999999996": 1250,
      "TIME_DELTA=2.95": 1251,
      "TIME_DELTA=2.999999999999999": 1252,
      "TIME_DELTA=3.458333333333333": 1253,
      "TIME_DELTA=3.55": 1254,
